// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

// let arr = ['a', 'b', 'c'];
// for (i = 1; i < 4; i++){
//         arr.push(i);
// }
// console.log(arr);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let delArr = [];
// let arr = [1, 2, 3];
// console.log(arr);
// for (i = 0; i <= arr.length; i++){
//         delArr.push(arr.shift(i));
// }
// for (i = 0; i <= delArr.length; i++){
//         arr.push(delArr.pop(i))
// }
// console.log(arr);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let arr = [1, 2, 3];
// for (let i = 4; i < 7; i++){
//         arr.push(i);
// }
// console.log(arr);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// let arr = [1, 2, 3];
// for (let i = 6; i > 3; i--){
//         arr.unshift(i);
// }
// console.log(arr);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// let arr = ['js', 'css', 'jq'];
// let j = arr.shift(0);
// arr.unshift(j);
// console.log(j);
// console.log(arr);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

// let arr = ['js', 'css', 'jq'];
// let j = arr.pop(0);
// arr.push(j);
// console.log(j);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(0, 3);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(2, 3);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(1, 2);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, 'a', 'b', 'c');
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього 
// масив[1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(1, 0, 'a', 'b');
// arr.splice(6, 0, 'c');
// arr.splice(8,0, 'e')
// console.log(arr);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

// let arr = [];
// for (let i = 0; i < 10; i++){
//     arr.push(i);
//     if (i % 2 == 0) {
//         console.log(arr[i]);
//     }
// }

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push ()
// скопіювати значення одного масиву в інший

//  arr = [];
// for (let i = 0; i < 10; i++){
//     arr.push(i);
// }
// arr1 = [];
// for (let i = 0; i < arr.length; i++){
//     arr1.push(arr[i]);
// }
// console.log(arr1);


// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати
// значення одного масиву в інший.

// let arr = [];
// for (let i = 10; i < 20; i++) {
//     arr.push(i)
// }
// let arr1 = [];
// for (let i = 0; i < arr.length; i++){
//     arr1[i] = arr[i];
// }
// console.log(arr1);

// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while

// let i = 0;
// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// while (i < arr.length) {
//     console.log(arr[i]);
//     i++
// }

// 2. перебрати його циклом for

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
// for (let i = 0; i < arr.length; i++){
//     console.log(arr[i]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let i = 0;
// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// while (i < arr.length) {
//     if (i % 2 == 1) {
//         console.log(arr[i]);
//     }
//     i++
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < arr.length; i++) {
//     if (i % 2 == 1) {
//         console.log(arr[i]);
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let i = 0;
// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// while (i < arr.length) {
//     if (arr[i]% 2 == 0) {
//         console.log(arr[i]);
//     }
//     i++
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 == 0) {
//         console.log(arr[i]);
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 == 0) {
//         arr.splice(i, 1, 'okten');
//     }
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = arr.length-1; i >= 0; i--){
//     console.log(arr[i]);
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
        // 1. перебрати його циклом while

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = arr.length-1;
// while (i >= 0) {
//     console.log(arr[i]);
//     i--
// }

        // 2. перебрати його циклом for

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18]
// for (let i = arr.length-1; i >=0; i--){
//     console.log(arr[i]);
// }

        // 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = arr.length - 1;
// while (i >= 0) {
//     if (i % 2 == 1) {
//         console.log(arr[i]);
//     }
//     i--
// }

        // 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = arr.length-1; i >=0; i--) {
//     if (i % 2 == 1) {
//         console.log(arr[i]);
//     }
// }

        // 5. перебрати циклом while та вивести  числа тільки парні  значення

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = arr.length-1;
// while (i >= 0) {
//     if (arr[i]% 2 == 0) {
//         console.log(arr[i]);
//     }
//     i--
// }

        // 6. перебрати циклом for та вивести  числа тільки парні  значення

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = arr.length-1; i >= 0; i--) {
//     if (arr[i] % 2 == 0) {
//         console.log(arr[i]);
//     }
// }

        // 7. замінити кожне число кратне 3 на слово "okten"

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = arr.length-1; i >=0 ; i--) {
//     if (arr[i] % 3 == 0) {
//         arr.splice(i, 1, 'okten');
//     }
//     console.log(arr[i]);
// }



// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.

// let arr = [];
// for (let i = 0; i < 999; i ++) {
//     if ( i % 2 == 0 && arr.length < 50)
//     {arr.push(i)}
// }
// console.log(arr);

// - заповнити його 50 непарними числами за допомоги циклу.

// let arr = [];
// for (let i = 0; i < 200; i ++) {
//     if ( i % 2 == 1 && arr.length < 50)
//     {arr.push(i)}
// }
// console.log(arr);


// 1
//  створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.

// let arr = [];
// for (let i = 0; i < 200; i+=2){
//     if (arr.length < 50) {
//         arr.push(i);
//     }
// }

// 2. заповнити його 50 непарними числами за допомоги циклу.

// let arr = [];
// for (i = 1; i < 500; i += 2){
//     if (arr.length < 50) {
//         arr.push(i);
//     }
// } 
// console.log(arr);

// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//  2. вывести на консоль  каждый третий елемент
//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.
//  5. Вывести каждый елемент массива у которого соседний с права элемент - парный
//   5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.
